// data/classes.js — 고1 학급 시간표 (A주/B주)
var CS_A={
'1금1':{월:['자율','2컴퓨터활용생산',null,null,null,'운건','일본어회화'],화:['직무의사소통','사출금형조립',null,null,'기계요소설계',null,'동아리'],수:['일본어회화','직무의사소통','3D 프린터용 제품 제작',null,null,null],목:['2학년 학생선택(밀링가공)',null,null,null,'일본어회화','운건'],금:['자율','직무의사소통','스마트 공장 기계 설비 유지관리',null,null,null]},
'1금2':{월:['자율','영어','국어','사회','한국사','수학','체육'],화:['사회','과학','수학','국어','영어','체육','동아리'],수:['과학','수학','한국사','자율','기초제도',null],목:['과학','미술','국어','사회','기계일반',null],금:['미술','미술','전기전자일반',null,'한국사','영어']},
'1기1':{월:['자율','기계요소설계',null,'운건','기계제어설계',null,null],화:['컴퓨터응용가공',null,null,null,'일본어회화','직무의사소통','동아리'],수:['자동화시스템',null,null,null,'직무의사소통','일본어회화'],목:['2학년 학생선택(선반가공)',null,null,null,'운건','직무의사소통'],금:['자율','일본어회화','스마트 공장 기계 설비 유지관리',null,null,null]},
'1기2':{월:['자율','사회','자율','한국사','체육','미술','미술'],화:['과학','한국사','국어','체육','사회','수학','동아리'],수:['국어','과학','기계일반',null,'영어','미술'],목:['전기전자일반',null,'기초제도',null,'수학','영어'],금:['수학','국어','영어','한국사','사회','과학']},
'1용1':{월:['자율','기계요소설계',null,null,'레이저가공',null,null],화:['용접과제제작',null,null,null,null,null,'동아리'],수:['3학년 학생선택(내선공사)',null,null,null,'레이저가공','로봇용접'],목:['로봇용접',null,null,'용접과제제작','운건','운건'],금:['자율','용접과제제작',null,null,null,'기계요소']},
'1용2':{월:['자율','수학','한국사','자율','사회','국어','영어'],화:['기계일반',null,'기초제도',null,'미술','미술','동아리'],수:['수학','영어','국어','한국사','미술','과학'],목:['사회','체육','국어','영어','전기전자일반',null],금:['과학','한국사','사회','체육','과학','수학']}
};

var CS_B={
'1금1':{월:['자율','2컴퓨터활용생산',null,null,null,'운건','일본어회화'],화:['직무의사소통','사출금형조립',null,null,'기계요소설계',null,'동아리'],수:['일본어회화','직무의사소통','3D 프린터용 제품 제작',null,null,null],목:['2학년 학생선택(밀링가공)',null,null,null,'일본어회화','운건'],금:['자율','직무의사소통','스마트 공장 기계 설비 유지관리',null,null,null]},
'1금2':{월:['자율','영어','국어','사회','한국사','수학','체육'],화:['사회','과학','수학','국어','영어','체육','동아리'],수:['과학','수학','한국사','자율','기초제도',null],목:['과학','미술','국어','사회','기계일반',null],금:['미술','미술','전기전자일반',null,'한국사','영어']},
'1기1':{월:['자율','기계요소설계',null,'운건','기계제어설계',null,null],화:['컴퓨터응용가공',null,null,null,'일본어회화','직무의사소통','동아리'],수:['자동화시스템',null,null,null,'직무의사소통','일본어회화'],목:['2학년 학생선택(선반가공)',null,null,null,'운건','직무의사소통'],금:['자율','일본어회화','스마트 공장 기계 설비 유지관리',null,null,null]},
'1기2':{월:['자율','사회','자율','한국사','체육','미술','미술'],화:['과학','한국사','국어','체육','사회','수학','동아리'],수:['국어','과학','기계일반',null,'영어','미술'],목:['전기전자일반',null,'기초제도',null,'수학','영어'],금:['수학','국어','영어','한국사','사회','과학']},
'1용1':{월:['자율','기계요소설계',null,null,'레이저가공',null,null],화:['용접과제제작',null,null,null,null,null,'동아리'],수:['3학년 학생선택(내선공사)',null,null,null,'레이저가공','로봇용접'],목:['로봇용접',null,null,'용접과제제작','운건','운건'],금:['자율','용접과제 제작',null,null,null,'기계요소']},
'1용2':{월:['자율','수학','한국사','자율','사회','국어','영어'],화:['기계일반',null,'기초제도',null,'미술','미술','동아리'],수:['수학','영어','국어','한국사','미술','과학'],목:['사회','체육','국어','영어','전기전자일반',null],금:['과학','한국사','사회','체육','과학','수학']}
};

// 현재 활성 학급 시간표
var CS={};
for(var k in CS_A)CS[k]={};for(var k in CS_A)for(var d in CS_A[k])CS[k][d]=CS_A[k][d].slice();
