// data/classes.js — 고1 6반 시간표
var CS={
'1용1':{월:['자율','영어','기초제도',null,'전기전자일반',null,'과학'],화:['자율','사회','한국사','영어','국어','과학','동아리'],수:['미술','미술','체육','국어','한국사','수학'],목:['체육','기계일반',null,'국어','사회','수학'],금:['사회','영어','과학','미술','수학','한국사']},
'1용2':{월:['자율','수학','한국사','자율','사회','국어','영어'],화:['기계일반',null,'기초제도',null,'미술','미술','동아리'],수:['수학','영어','국어','한국사','미술','과학'],목:['사회','체육','국어','영어','전기전자일반',null],금:['과학','한국사','사회','체육','과학','수학']},
'1기1':{월:['자율','국어','미술','미술','과학','기계일반',null],화:['수학','자율','사회','한국사','전기전자일반',null,'동아리'],수:['사회','한국사','수학','영어','과학','국어'],목:['수학','영어','체육','한국사','미술','과학'],금:['기초제도',null,'국어','사회','체육','영어']},
'1기2':{월:['자율','사회','자율','한국사','체육','미술','미술'],화:['과학','한국사','국어','체육','사회','수학','동아리'],수:['국어','과학','기계일반',null,'영어','미술'],목:['전기전자일반',null,'기초제도',null,'수학','영어'],금:['수학','국어','영어','한국사','사회','과학']},
'1금1':{월:['자율','과학','사회','영어','수학','체육','한국사'],화:['국어','미술','미술','수학','체육','사회','동아리'],수:['기초제도',null,'자율','과학','기계일반',null],목:['미술','한국사','영어','과학','국어','사회'],금:['한국사','수학','영어','국어','전기전자일반',null]},
'1금2':{월:['자율','영어','국어','사회','한국사','수학','체육'],화:['사회','과학','수학','국어','영어','체육','동아리'],수:['과학','수학','한국사','자율','기초제도',null],목:['과학','미술','국어','사회','기계일반',null],금:['미술','미술','전기전자일반',null,'한국사','영어']}
};
